# Задача 14. Уникальные технологии
# Пользователь вводит названия технологий через пробел. Выведи:
#
# количество введённых названий;
# количество уникальных названий;
# уникальные названия в алфавитном порядке.
# Регистр не должен влиять на уникальность: Python и python считаются одним названием.

data = input("Введите технологии через пробел: ")

tech_list = data.lower().split()

tech_set = set(tech_list)

# количество введённых названий;
print(f"количество введённых названий: {len(tech_list)}")

# количество уникальных названий;
print(f"количество введённых названий: {len(tech_set)}")

# уникальные названия в алфавитном порядке.
print("Уникальные по алфавиту:", sorted(tech_set))

