# 6. Множества
# Множество хранит только уникальные элементы.
#
# a | b  # объединение
# a & b  # пересечение
# a - b  # разность
# a ^ b  # элементы только одного из множеств

# Задача 13. Доступ к сервисам
# Даны пользователи двух сервисов:
#
music_users = {"Анна", "Борис", "Олег", "Мария"}
cloud_users = {"Олег", "Мария", "Игорь", "Светлана"}

# Выведи в алфавитном порядке, всех пользователей хотя бы одного сервиса.
all_users = list(music_users | cloud_users)
all_users.sort()
print(all_users)

# Пользователей обоих сервисов.
all_users = music_users & cloud_users
print(all_users)

# Пользователей только музыкального сервиса.
print(music_users - cloud_users)

# Пользователей, использующих ровно один из сервисов.
print(cloud_users ^ music_users)
