# 4. range()
# range(конец)
# range(начало, конец)
# range(начало, конец, шаг)
# Правая граница не входит в последовательность.

# Задача 9. Последовательности
# С помощью отдельных циклов выведи:
#
# Числа от 12 до 20 включительно.
# Чётные числа от 10 до 30 включительно.
# Числа 50 45 40 35 30 25.
# Для каждого цикла самостоятельно определи начало, границу и шаг.

for i in range(12, 21):
    print(i)

print("-----")
for i in range(10, 31, 2):
    print(i)


print("-----")
for i in range(50, 24, -5):
    print(i)