# 3. Кортежи
# Кортеж — упорядоченная коллекция, элементы которой нельзя заменить, добавить или удалить.
#
# point = (10, 25)
# x, y = point
# Кортеж подходит для значений, которые образуют одну фиксированную запись: координаты, цвет RGB, размеры экрана.

# Задача 7. Размер окна
# Дан кортеж:
#
# screen_size = (1920, 1080)
# Распакуй значения в переменные width и height.
# Выведи строку Ширина: 1920, высота: 1080.
# Вычисли количество пикселей.
# Попробуй заменить первый элемент кортежа. Закомментируй строку с ошибкой и объясни в комментарии, почему она возникла.

screen_size = (1920, 1080)

# Выполни задания
width, height = screen_size
print(f"Ширина: {width}, Высота: {height}")
print(f"Количество пикселей: {width * height}")
screen_size[0] = "1000"

# TypeError: 'tuple' object does not support item assignment - кортежи не изменяются, по этому ошибка